{"pageProps":{"frontMatter":{"title":"Bamboo - Frequently Asked Questions","date":"April 20, 2023","excerpt":"Learn some interesting facts about bamboo.","author":"James Thomas","image":"/images/article-images/bamboofaq/bamboofaqtext.png","tags":["bamboo","Q&A"],"category":"bamboo"},"content":"\n## What Types of Bamboo are There?\n\nThere are two types of bamboo. The first is running bamboo, and the second is clumping bamboo. Running bamboo is the group of bamboo that will spread, whilew clumping bamboo will not spread very far at all.\n\n## How do I Control Bamboo?\n\nBamboo can be controlled with a thick rhizome barrier, regular intervals of rhizome pruning, or with a source of standing water. Bamboo will also not spread into heavily treaded areas such as roads, driveways, and compacted soil. However, there is an exception to every rule.\n\n## How Fast Does Bamboo Grow?\n\nBamboo can grow extremely fast. It is the fastest growing plant in the world, and can grow up to 1 inch per hour (2.54cm).\n\n## Is Bamboo Edible?\n\nYes, bamboo is edible. However, due to a small amount of toxins within their shoots they need to be cooked for 2 hours in boiling water. When all traces of bitterness have left the shoot after boiling, then it is completely safe to be eaten. Bamboo species all ahve varying levels of toxins, a few members of the phyllostachys family can be eaten fresh without the need for boiling.\n\n## Is Bamboo Invasive?\n\nBamboo is only invasive if left to grow unchecked. When controlled properly, bamboo will not spread too far. It will also be controlled by trees (such as a forest), as they will prevent bamboo from growing through their thick root system. Water sources are capable of stopping bamboo growth completely, because bamboo rhizomes will rot when they stay in water for too long. \n\n## Is Bamboo a Tree, Grass, or Vegetable?\n\nDespite containing lignin, bamboo is a grass, not a tree. \n\n## What is Bamboo Used For?\n\nBamboo has many uses. It can be used for biofuel, construction, flooring, arts and crafts, food, recreation, and it can help improve the environment.\n\n## What are Some Popular Species of Bamboo?\n\n## What is the Tallest Bamboo Species?\n\nThe tallest species of bamboo is Dendrocalamus Sinicus, aka Dragon Bamboo. It grows up to 140 feet (42m) tall. The maximum culm diameter is 12-14 inches (30-36cm). This species of bamboo is tropical and will only live in warm areas of the world where temperatures stay above freezing all year long.\n\n## What are the Growing Conditions of Bamboo?\n\n\n","post":"bamboofaq"},"__N_SSG":true}